{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.2", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_word_ids"}, "name": "input_word_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_mask"}, "name": "input_mask", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "int32", "sparse": false, "ragged": false, "name": "segment_ids"}, "name": "segment_ids", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-24_H-1024_A-16/1"}, "name": "keras_layer", "inbound_nodes": [[["input_word_ids", 0, 0, {}], ["input_mask", 0, 0, {}], ["segment_ids", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["keras_layer", 0, 1, {"slice_spec": [{"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}], "input_layers": [["input_word_ids", 0, 0], ["input_mask", 0, 0], ["segment_ids", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 6.000000212225132e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of320.bin", "group1-shard2of320.bin", "group1-shard3of320.bin", "group1-shard4of320.bin", "group1-shard5of320.bin", "group1-shard6of320.bin", "group1-shard7of320.bin", "group1-shard8of320.bin", "group1-shard9of320.bin", "group1-shard10of320.bin", "group1-shard11of320.bin", "group1-shard12of320.bin", "group1-shard13of320.bin", "group1-shard14of320.bin", "group1-shard15of320.bin", "group1-shard16of320.bin", "group1-shard17of320.bin", "group1-shard18of320.bin", "group1-shard19of320.bin", "group1-shard20of320.bin", "group1-shard21of320.bin", "group1-shard22of320.bin", "group1-shard23of320.bin", "group1-shard24of320.bin", "group1-shard25of320.bin", "group1-shard26of320.bin", "group1-shard27of320.bin", "group1-shard28of320.bin", "group1-shard29of320.bin", "group1-shard30of320.bin", "group1-shard31of320.bin", "group1-shard32of320.bin", "group1-shard33of320.bin", "group1-shard34of320.bin", "group1-shard35of320.bin", "group1-shard36of320.bin", "group1-shard37of320.bin", "group1-shard38of320.bin", "group1-shard39of320.bin", "group1-shard40of320.bin", "group1-shard41of320.bin", "group1-shard42of320.bin", "group1-shard43of320.bin", "group1-shard44of320.bin", "group1-shard45of320.bin", "group1-shard46of320.bin", "group1-shard47of320.bin", "group1-shard48of320.bin", "group1-shard49of320.bin", "group1-shard50of320.bin", "group1-shard51of320.bin", "group1-shard52of320.bin", "group1-shard53of320.bin", "group1-shard54of320.bin", "group1-shard55of320.bin", "group1-shard56of320.bin", "group1-shard57of320.bin", "group1-shard58of320.bin", "group1-shard59of320.bin", "group1-shard60of320.bin", "group1-shard61of320.bin", "group1-shard62of320.bin", "group1-shard63of320.bin", "group1-shard64of320.bin", "group1-shard65of320.bin", "group1-shard66of320.bin", "group1-shard67of320.bin", "group1-shard68of320.bin", "group1-shard69of320.bin", "group1-shard70of320.bin", "group1-shard71of320.bin", "group1-shard72of320.bin", "group1-shard73of320.bin", "group1-shard74of320.bin", "group1-shard75of320.bin", "group1-shard76of320.bin", "group1-shard77of320.bin", "group1-shard78of320.bin", "group1-shard79of320.bin", "group1-shard80of320.bin", "group1-shard81of320.bin", "group1-shard82of320.bin", "group1-shard83of320.bin", "group1-shard84of320.bin", "group1-shard85of320.bin", "group1-shard86of320.bin", "group1-shard87of320.bin", "group1-shard88of320.bin", "group1-shard89of320.bin", "group1-shard90of320.bin", "group1-shard91of320.bin", "group1-shard92of320.bin", "group1-shard93of320.bin", "group1-shard94of320.bin", "group1-shard95of320.bin", "group1-shard96of320.bin", "group1-shard97of320.bin", "group1-shard98of320.bin", "group1-shard99of320.bin", "group1-shard100of320.bin", "group1-shard101of320.bin", "group1-shard102of320.bin", "group1-shard103of320.bin", "group1-shard104of320.bin", "group1-shard105of320.bin", "group1-shard106of320.bin", "group1-shard107of320.bin", "group1-shard108of320.bin", "group1-shard109of320.bin", "group1-shard110of320.bin", "group1-shard111of320.bin", "group1-shard112of320.bin", "group1-shard113of320.bin", "group1-shard114of320.bin", "group1-shard115of320.bin", "group1-shard116of320.bin", "group1-shard117of320.bin", "group1-shard118of320.bin", "group1-shard119of320.bin", "group1-shard120of320.bin", "group1-shard121of320.bin", "group1-shard122of320.bin", "group1-shard123of320.bin", "group1-shard124of320.bin", "group1-shard125of320.bin", "group1-shard126of320.bin", "group1-shard127of320.bin", "group1-shard128of320.bin", "group1-shard129of320.bin", "group1-shard130of320.bin", "group1-shard131of320.bin", "group1-shard132of320.bin", "group1-shard133of320.bin", "group1-shard134of320.bin", "group1-shard135of320.bin", "group1-shard136of320.bin", "group1-shard137of320.bin", "group1-shard138of320.bin", "group1-shard139of320.bin", "group1-shard140of320.bin", "group1-shard141of320.bin", "group1-shard142of320.bin", "group1-shard143of320.bin", "group1-shard144of320.bin", "group1-shard145of320.bin", "group1-shard146of320.bin", "group1-shard147of320.bin", "group1-shard148of320.bin", "group1-shard149of320.bin", "group1-shard150of320.bin", "group1-shard151of320.bin", "group1-shard152of320.bin", "group1-shard153of320.bin", "group1-shard154of320.bin", "group1-shard155of320.bin", "group1-shard156of320.bin", "group1-shard157of320.bin", "group1-shard158of320.bin", "group1-shard159of320.bin", "group1-shard160of320.bin", "group1-shard161of320.bin", "group1-shard162of320.bin", "group1-shard163of320.bin", "group1-shard164of320.bin", "group1-shard165of320.bin", "group1-shard166of320.bin", "group1-shard167of320.bin", "group1-shard168of320.bin", "group1-shard169of320.bin", "group1-shard170of320.bin", "group1-shard171of320.bin", "group1-shard172of320.bin", "group1-shard173of320.bin", "group1-shard174of320.bin", "group1-shard175of320.bin", "group1-shard176of320.bin", "group1-shard177of320.bin", "group1-shard178of320.bin", "group1-shard179of320.bin", "group1-shard180of320.bin", "group1-shard181of320.bin", "group1-shard182of320.bin", "group1-shard183of320.bin", "group1-shard184of320.bin", "group1-shard185of320.bin", "group1-shard186of320.bin", "group1-shard187of320.bin", "group1-shard188of320.bin", "group1-shard189of320.bin", "group1-shard190of320.bin", "group1-shard191of320.bin", "group1-shard192of320.bin", "group1-shard193of320.bin", "group1-shard194of320.bin", "group1-shard195of320.bin", "group1-shard196of320.bin", "group1-shard197of320.bin", "group1-shard198of320.bin", "group1-shard199of320.bin", "group1-shard200of320.bin", "group1-shard201of320.bin", "group1-shard202of320.bin", "group1-shard203of320.bin", "group1-shard204of320.bin", "group1-shard205of320.bin", "group1-shard206of320.bin", "group1-shard207of320.bin", "group1-shard208of320.bin", "group1-shard209of320.bin", "group1-shard210of320.bin", "group1-shard211of320.bin", "group1-shard212of320.bin", "group1-shard213of320.bin", "group1-shard214of320.bin", "group1-shard215of320.bin", "group1-shard216of320.bin", "group1-shard217of320.bin", "group1-shard218of320.bin", "group1-shard219of320.bin", "group1-shard220of320.bin", "group1-shard221of320.bin", "group1-shard222of320.bin", "group1-shard223of320.bin", "group1-shard224of320.bin", "group1-shard225of320.bin", "group1-shard226of320.bin", "group1-shard227of320.bin", "group1-shard228of320.bin", "group1-shard229of320.bin", "group1-shard230of320.bin", "group1-shard231of320.bin", "group1-shard232of320.bin", "group1-shard233of320.bin", "group1-shard234of320.bin", "group1-shard235of320.bin", "group1-shard236of320.bin", "group1-shard237of320.bin", "group1-shard238of320.bin", "group1-shard239of320.bin", "group1-shard240of320.bin", "group1-shard241of320.bin", "group1-shard242of320.bin", "group1-shard243of320.bin", "group1-shard244of320.bin", "group1-shard245of320.bin", "group1-shard246of320.bin", "group1-shard247of320.bin", "group1-shard248of320.bin", "group1-shard249of320.bin", "group1-shard250of320.bin", "group1-shard251of320.bin", "group1-shard252of320.bin", "group1-shard253of320.bin", "group1-shard254of320.bin", "group1-shard255of320.bin", "group1-shard256of320.bin", "group1-shard257of320.bin", "group1-shard258of320.bin", "group1-shard259of320.bin", "group1-shard260of320.bin", "group1-shard261of320.bin", "group1-shard262of320.bin", "group1-shard263of320.bin", "group1-shard264of320.bin", "group1-shard265of320.bin", "group1-shard266of320.bin", "group1-shard267of320.bin", "group1-shard268of320.bin", "group1-shard269of320.bin", "group1-shard270of320.bin", "group1-shard271of320.bin", "group1-shard272of320.bin", "group1-shard273of320.bin", "group1-shard274of320.bin", "group1-shard275of320.bin", "group1-shard276of320.bin", "group1-shard277of320.bin", "group1-shard278of320.bin", "group1-shard279of320.bin", "group1-shard280of320.bin", "group1-shard281of320.bin", "group1-shard282of320.bin", "group1-shard283of320.bin", "group1-shard284of320.bin", "group1-shard285of320.bin", "group1-shard286of320.bin", "group1-shard287of320.bin", "group1-shard288of320.bin", "group1-shard289of320.bin", "group1-shard290of320.bin", "group1-shard291of320.bin", "group1-shard292of320.bin", "group1-shard293of320.bin", "group1-shard294of320.bin", "group1-shard295of320.bin", "group1-shard296of320.bin", "group1-shard297of320.bin", "group1-shard298of320.bin", "group1-shard299of320.bin", "group1-shard300of320.bin", "group1-shard301of320.bin", "group1-shard302of320.bin", "group1-shard303of320.bin", "group1-shard304of320.bin", "group1-shard305of320.bin", "group1-shard306of320.bin", "group1-shard307of320.bin", "group1-shard308of320.bin", "group1-shard309of320.bin", "group1-shard310of320.bin", "group1-shard311of320.bin", "group1-shard312of320.bin", "group1-shard313of320.bin", "group1-shard314of320.bin", "group1-shard315of320.bin", "group1-shard316of320.bin", "group1-shard317of320.bin", "group1-shard318of320.bin", "group1-shard319of320.bin", "group1-shard320of320.bin"], "weights": [{"name": "dense/kernel", "shape": [1024, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "bert_model/word_embeddings/embeddings", "shape": [30522, 1024], "dtype": "float32"}, {"name": "bert_model/embedding_postprocessor/type_embeddings", "shape": [2, 1024], "dtype": "float32"}, {"name": "bert_model/embedding_postprocessor/position_embeddings", "shape": [512, 1024], "dtype": "float32"}, {"name": "bert_model/embedding_postprocessor/layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/embedding_postprocessor/layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_0/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_1/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_2/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_3/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_4/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_5/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_6/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_7/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_8/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_9/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_10/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_11/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_12/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_13/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_14/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_15/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_16/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_17/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_18/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_19/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_20/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/intermediate/bias", "shape": [4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/output/kernel", "shape": [4096, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/output_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_21/output_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/query/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/query/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/key/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/key/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/value/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention/value/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention_output/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention_output/bias", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention_layer_norm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/self_attention_layer_norm/beta", "shape": [1024], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/intermediate/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "bert_model/encoder/layer_22/intermediate/bias", "shape": [4096], 